<?php
// 1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.
function task_1($cicle, $delimetr = '3'){
		$i = 0;
		while ($i <= $cicle) {
				if ($i % $delimetr == 0) {
						$oth[] = $i;
				}
				$i++;
		}
		return $oth;
}
// 2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
function task_2($i = '0', $stop = '10'){
		do {
				$count = "$i не четное число<br />";
				if ($i == false) {
						$count = "$i равен нулю<br />";
				}
				elseif ($i % 2 == 0) {
						$count = "$i Четное число<br />";
				}
				echo $count;
				$i++;
		}
		while ($i <= $stop);
}
//  3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:
$city = ['Московская область' => ['Москва', 'Зеленоград', 'Клин'], 'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'], 'Рязанская область' => ['Рязань', 'Касимов', 'Сасово', 'Михайлов', ]];
// 4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
function translit($string, $task='5') {
    $converter = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
        
        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
    );
    if($task == 4) {
        return strtr($string, $converter);
    }
    return replace_earth(strtr($string, $converter));
}
// 5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.
function replace_earth($str){
		return str_replace(' ', '_', $str);
}
// 6. В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP. Необходимо представить пункты меню как элементы массива и вывести их циклом. Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать
$menu = [];
for ($i = 1; $i <= 5; $i++) {
		$list = 1;
		$menu['Меню_' . $i] = ['Подменю_' . $i . '_' . $list++, 'Подменю_' . $i . '_' . $list++, 'Подменю_' . $i . '_' . $list++, 'Подменю_' . $i . '_' . $list++];
}
// 8.
function task_8($arr){
		foreach($arr as $key => $value) {
				foreach($value as $row) {
						if (mb_substr($row, 0, 1) == 'К') {
								echo $row . '<br />';
						}
				}
		}
}